/* eslint-disable */
export default {
  phone: /^(13[0-9]|14[0-9]|15[0-9]|16[0-9]|17[0-9]|18[0-9]|19[0-9])\d{8}$/,
  tell: /^\d{3,4}\d{7,8}$/, //座机
  zh_Name: /^[\u4e00-\u9fa5|a-zA-Z]{2,}$/,
  idNumber: /^(^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$)|(^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])((\d{4})|\d{3}[Xx])$)$/,
  zhanghu: /^[0-9]*$/,
  hanzi: /^[\u2E80-\u9FFF]+$/,
  uniformCreditCode: /^[0-9A-Z]{18}$/,
  vCode6: /^\d{6}$/, // 6位验证码
  email: /^([a-zA-Z]|[0-9])(\w|\-)+@[a-zA-Z0-9]+\.([a-zA-Z]{2,4})$/,
  numberFloatTwo: /^\d+(\.\d{1,2})?$/, //正整数或保留两位小数以内
  number: /^\d+$/, //正整数
  bankCardNumber: /^[0-9]{10,20}$/, //银行卡号
  url: /^((https|http){0,1}(:\/\/){0,1})www\.(([A-Za-z0-9-~]+)\.)+([A-Za-z0-9-~\/])+$/,
  qqEmail: /^\d{5,12}@[q][q]\.(com|cn)$/,
};
